
INSERT INTO Teachers(
  FIO, [date of birth], [date of employment])
VALUES
('Веренинов Игорь Андреевич', '1939-05-16', '1955-06-11'),
('Попов Борис Петрович', '1949-02-14', '1972-03-10'),
('Устинов Сергей Михайлович', '1961-10-14', '1985-08-04'),
('Петров Александр Валентинович', '1967-09-15', '2005-06-11'),
('Амосов Сергей Андреевич', '1939-05-16', '1955-06-11'),
('Александрова Ольга Всеволодовна', '1989-05-16', '2012-05-26')

INSERT INTO Groups(
  class, [Klassniy rukovoditel])
VALUES
('9', '1'),
('9', '2'),
('10', '3'),
('11', '4'),
('11', '5'),
('12', '6')

INSERT INTO Students(
  FIO, [date of birth], class, groupId)
VALUES
('Стоноженко Кирилл Максимович', '1998-10-18', '9', '1'),
('Нгуен Хай Йен', '1997-04-22', '9', '1'),
('Алейников Павел Алексеевич', '1998-03-24', '9', '1'),
('Чернов Денис Павлович', '1997-07-28', '9', '2'),
('Нгуен Трунг Киен', '1999-01-14', '9', '2'),
('Тринь Ван Тхань', '1999-01-03', '9', '2'),

('Мулонде Филипе ди Насшименту', '1997-01-05', '10', '3'),
('Шемякинская Анастасия Сергеевна', '1998-12-15', '10', '3'),
('Амиросланов Елмар Ильевич', '1997-03-09', '10', '3'),

('Бойков Кирилл Валентинович', '1998-10-17', '11', '4'),
('Артемьева Виктория Димитровна', '1997-01-01', '11', '4'),
('Шкригунов Алексей Константинович', '1997-11-13', '11', '4'),
('Максимов Валентин Кирилович', '1997-05-23', '11', '4'),
('Петров Денис Петрович', '1998-04-23', '11', '5'),
('Круглов Андрей Андрейевич', '1997-06-29', '11', '5'),

('Боженко Дияна Петровна', '1997-02-19', '12', '6'),
('Соколова Александра Андреевна', '1996-07-07', '12', '6'),
('Ракитин Олег Максимович', '1996-10-11', '12', '6')

INSERT INTO UchebniPlan(
  class, predmetnayaOblast, uchebniyPredmet, [hours per week])
VALUES
('9', 'Филология', 'Русский Язык', '3'),
('9', 'Математика и информатика', 'Алгебра', '3'),
('9', 'Математика и информатика', 'Информатика', '1'),
('9', 'Общественно-научные предметы', 'История', '2'),
('9', 'Естественно-научные предметы', 'Физика', '3'),
('9', 'Естественно-научные предметы', 'Химия', '3'),

('10', 'Филология', 'Литература', '3'),
('10', 'Филология', 'Иностранный язык', '2'),
('10', 'Математика и информатика', 'Геометрия', '3'),
('10', 'Математика и информатика', 'Информатика', '2'),
('10', 'Общественно-научные предметы', 'География', '3'),
('10', 'Естественно-научные предметы', 'Физика', '2'),
('10', 'Естественно-научные предметы', 'Биология', '2'),

('11', 'Филология', 'Русский Язык', '2'),
('11', 'Филология', 'Литература', '1'),
('11', 'Математика и информатика', 'Алгебра', '2'),
('11', 'Математика и информатика', 'Геометрия', '2'),
('11', 'Математика и информатика', 'Информатика', '1'),
('11', 'Общественно-научные предметы', 'Обшествознаие', '1'),
('11', 'Естественно-научные предметы', 'Физика', '2'),
('11', 'Искусство', 'Музыка', '1'),

('12', 'Филология', 'Литература', '3'),
('12', 'Филология', 'Иностранный язык', '3'),
('12', 'Математика и информатика', 'Геометрия', '4'),
('12', 'Математика и информатика', 'Информатика', '2'),
('12', 'Общественно-научные предметы', 'История', '2'),
('12', 'Естественно-научные предметы', 'Физика', '1'),
('12', 'Естественно-научные предметы', 'Химия', '2'),
('12', 'Искусство', 'Изобразительное искусство', '1')


INSERT INTO Lessons(
  predmetId, teacherId, groupId)
VALUES
('1','4','1'),
('1','4','2'),
('2','3','1'),
('2','3','2'),
('3','3','1'),
('3','3','2'),
('4','5','1'),
('4','5','2'),
('5','2','1'),
('5','2','2'),
('6','6','1'),
('6','6','2'),

('7','4','3'),
('8','6','3'),
('9','3','3'),
('10','1','3'),
('11','5','3'),
('12','2','3'),
('13','6','3'),

('14','4','4'),
('14','4','5'),
('15','4','4'),
('15','4','5'),
('16','3','4'),
('16','3','5'),
('17','3','4'),
('17','3','5'),
('18','1','4'),
('18','1','5'),
('19','5','4'),
('19','5','5'),
('20','2','4'),
('20','2','5'),
('21','6','4'),
('21','6','5'),

('22','4','6'),
('23','4','6'),
('24','3','6'),
('25','1','6'),
('26','5','6'),
('27','2','6'),
('28','5','6'),
('29','6','6')

select * from Raspisanie
select * from Students
select * from Groups
select * from UchebniPlan
select * from Teachers
select * from Lessons

--INSERTION ORDER
--teachers +
--groups +
--students + 
--uchebniPlan +
--lessons +
--zurnal +
--raspisanie
--qualifications

 select id, groupId from Students 
 select Lessons.id, Lessons.groupId, UchebniPlan.uchebniyPredmet from Lessons, UchebniPlan
   where UchebniPlan.id = Lessons.predmetId order by Lessons.groupId
 select * from Zurnal
 select * from Lessons

INSERT INTO Zurnal(
  StudentId, LessonId, Ocenka)
VALUES
('1','1','4'),
('2','3','3'),
('2','5','5'),
('3','7','4'),

('4','10','4'),
('4','12','4'),
('5','10','3'),
('5','8','4'),
('6','6','5'),
('6','4','3'),
('6','2','4'),

('7','14','4'),
('7','15','3'),
('7','16','5'),
('8','17','4'),
('8','18','4'),
('9','17','3'),
('9','19','5'),

('10','20','4'),
('10','24','3'),
('11','26','3'),
('11','34','5'),
('12','28','5'),
('13','28','4'),
('13','30','4'),

('14','25','3'),
('14','23','4'),
('15','23','4'),
('15','21','5'),

('16','37','4'),
('16','38','4'),
('17','43','5'),
('17','41','3'),
('17','42','4'),
('18','43','4'),
('18','36','5')

select * from Zurnal

select * from Raspisanie
select * from Lessons

INSERT INTO Raspisanie(
  lessonId, day, [time from], [time to], classroom)
VALUES
('1','1','10:00', '11:30', '237a'), 
('1','4','10:00', '11:30', '237a'), 
('2','2','12:00', '13:30', '235'), 
('2','3','10:00', '11:30', '235'), 
('3','5','14:00', '15:30', '222'), 
('4','3','16:00', '17:30', '222'), 
('5','2','10:00', '11:30', '118'), 
('6','2','12:00', '13:30', '119'), 
('7','3','14:00', '15:30', '204b'), 
('8','3','16:00', '17:30', '204b'), 
('9','4','12:00', '13:30', '237a'), 
('9','4','14:00', '15:30', '237a'), 
('10','5','16:00', '17:30', '235'), 
('11','5','10:00', '11:30', '202'), 
('11','1','12:00', '13:30', '119'), 
('12','2','14:00', '15:30', '115')

select * from Raspisanie